// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

// let time = Math.round(Math.random() * 60);
//
// if (time < 15) {
//     console.log(`Дане число: ${time} - попадає до 1-шої четверті години.`);
// }
// if (time >= 15 && time < 30) {
//     console.log(`Дане число: ${time} - попадає до 2-шої четверті години.`);
// }
// if (time >= 30 && time < 45) {
//     console.log(`Дане число: ${time} - попадає до 3-шої четверті години.`);
// }
//
// if (time >= 45 && time < 60) {
//     console.log(`Дане число: ${time} - попадає до 4-шої четверті години.`);
// }

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

// let min = 1;
// let max = 31;
// let day = Math.floor(Math.random() * (max - min + 1)) + min;
//
// if (day < 11) {
//     console.log(`Дане число: ${day} - попадає у першу половину місяця`)
// }
//
// if (day >= 11 && day < 22) {
//     console.log(`Дане число: ${day} - попадає у другу половину місяця`)
// }
// if (day >= 22) {
//     console.log(`Дане число: ${day} - попадає у третю половину місяця`)
// }

//
// - У нас є змінна test, якщо  не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

// let test = confirm('Ok = true, Cancel = false');

// if (!test) {
//     alert('Вірно');
// } else alert('Неправильно');

// !test ? alert('Вірно') : alert('Неправильно');


// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

// let a = 1;
// let a = 0;
// let a = -3;
// a !== 0 ? console.log('Вірно') : console.log('Невірно');

// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.

// let numOfDay = +prompt('Введіть номер дня тижня');
//
// switch (numOfDay) {
//     case 1:
//         console.log('Понеділок');
//         break;
//     case 2 :
//         console.log('Вівторок');
//         break;
//     case 3:
//         console.log('Середа');
//         break;
//     case 4 :
//         console.log('Четвер');
//         break;
//     case 5 :
//         console.log('Пятниця');
//         break;
//     case 6:
//         console.log('Субота');
//         break;
//     case 7 :
//         console.log('Неділя');
//         break;
//     default:
//         console.log('Wait ...');
// }

// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

let year = +prompt('Введіть поточний рік');

if (year % 4 === 0) {
    alert('Рік високосний')
} else alert('Рік не високосний')

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

// let nameJS = prompt('Яка «офіційна» назва JavaScript?');
//
// if (nameJS === 'ECMAScript') {
//     alert('Правильно')
// } else alert('Не знаєте? ECMAScript !')
