// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
//
// if (friends.length >= 3) {
//     alert('Великий масив, в якому  3 і більше елементи.');
// } else alert('Це маленький масив, в якому менше 3-х елементів.')

// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

// let num1 = +prompt('Введіть перше число');
// let num2 = +prompt('Введіть друге число');
// let num3 = +prompt('Введіть третє число');
//
// if (num1 > num2 && num1 < num3) {
//     console.log(`${num1} - є середнім числом`);
// } else if (num2 > num1 && num2 < num3) {
//     console.log(`${num2} - є середнім числом`);
// } else if (num3 > num1 && num3 < num2) {
//     console.log(`${num3} - є середнім числом`);
// }

// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }

// let result;
// (a + b < 4) ? result = 'Мало' : result = 'Багато';
// console.log(result);

// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

let number = prompt('Введіть значення');

let msg = (number < 0) ? 'Негативне значення' :
    (number > 0) ? 'Позитивне значення' :
        'Нульове значення';
alert(msg);
