// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.

// let num1 = +prompt('Введіть перше число');
// let num2 = +prompt('Введіть друге число');
//
// if (num1 > num2) {
//     alert(`Число №1: ${num1} більше числа №2: ${num2}`)
// }
//
// if (num1 < num2) {
//     alert(`Число №2: ${num2} більше числа №1: ${num1}`)
// }
//
// if (num1 === num2) {
//     alert(`Число №1: ${num1} рівне числу №2: ${num2}`)
// }

// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let room_number = +prompt('Введіть номер квартири');
// if (room_number > 0 && room_number <= 20) {
//     console.log('Дана квартира знаходиться у першому підїзді');
// } else if (room_number >= 21 && room_number <= 48) {
//     console.log('Дана квартира знаходиться у другому підїзді');
// } else if (room_number >= 49 && room_number <= 90) {
//     console.log('Дана квартира знаходиться у третьому підїзді');
// }

// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

// let number = +prompt('Введіть число');
//
// switch (number) {
//     case 10:
//         console.log('ВІРНО');
//         break;
//     default:
//         console.log('НЕВІРНО');
// }

//
// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else

// let x = [true];
//
// if ((typeof x) === 'number') {
//     console.log('1')
// } else if ((typeof x) === 'string') {
//     console.log('2')
// } else if ((typeof x) === 'boolean') {
//     console.log('3')
// } else if ((typeof x) === 'object' || Array.isArray(x)) {
//     console.log('4')
// }

// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

// let temp = prompt('Яка температура на вулиці?');
//
// if (temp >= 10 && temp <= 22) {
//     alert('Йдемо вчитися!');
// } else alert('Сидимо вдома і вчимося ОНЛАЙН');

// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

let num = +prompt('Введіть число від 1 до 5');

switch (num) {
    case 1 :
        alert('Вітаємо ви отримали приз - Авто');
        break;
    case 2 :
        alert('Вітаємо ви отримали приз - Мото');
        break;
    case 3 :
        alert('Вітаємо ви отримали приз - Телефон');
        break;
    case 4 :
        alert('Вітаємо ви отримали приз - Поповнення рахунку');
        break;
    case 5 :
        alert('Вітаємо ви отримали приз - Планшет');
        break;
    default: alert('Число не вірне ...')
}
